# 2. 重排序器 - 打分模型

https://github.com/ceilf6/FrontAgent/commit/cd9ebf7c4f851bb04702b7444bdd48ef272efcb2

向量检索算法是对一个向量找最相似的向量

像双向编码器、交叉编码器、重排序器等都是**对检索算法返回的文档进行打分**

# 重排序器

1. 先通过双向编码器**快速拿到一系列初级**筛选文档块，然后用交叉编码器对初级文档进行**精准**排行，进而返回最匹配的文档
2. LLM大模型重排序

# 双向编码器Bi-Encoder

即默认一般语义查找都是对查询语句向量化之后和通过嵌入模型对分块后的文档向量进行**匹配**

这样对文档的处理是提前的，那么到时候查询只需要将查询向量对提前处理的文档向量匹配，速度是很快的

# 交叉编码器Cross-Encoder

用时间换质量

虽然速度慢，但是能有比双向编码器显著更高质量的文档排名

交叉编码器会**将文档和查询进行拼接**，然后将组合文本输入到专用嵌入模型，以实现更深度的上下文交互，会直接输出相关系数

# Colbert

基于 BERT 的上下文延迟交互

缩小了颗粒度

核心思想：像双向编码器一样提前生成文档向量，但不是一个文档一个向量，而是为文档**每个token生成一个语义向量**，并尝试像交叉编码器一样捕获文档和查询之间的**交互**

缺点：需要存储的向量数量很多