# chunk文件分块

将长文本拆分为小文本块

首先就是嵌入模型的输入限制（429）

假如将一整个文档向量化成一个向量，那么**信息表达不完全**

分块大小

太大：上下文限制

太小：向量失去上下文信息

## 分块策略

### 1. 一开始是固定大小

分割点可能出现在文档的中间处，导致连接性不好，通常允通过允许分块重叠来解决

### 2. 本来想语义分块

但是**计算代价太高**

一次处理一个句子，判断是否和之前有**相似性**然后决定是否分块

### 3. 特殊字符分块

https://github.com/ceilf6/FrontAgent/commit/ce5f70a9a948bb995e875820107e4fccd061dc29

选择一个特定的字符进行分割，例如**换行符，可能会导致分块过大**

还有例如通过**标签分割HTML**

基于**函数定义分割JS**

- Markdown 标题、列表
- TS/JS 的 function/class/interface/type/const
- CSS 规则、@media/@keyframes
- HTML/Vue 的 template/script/style/section 等边界

语义的连贯性也是很重要的，例如跨语句的主语

### 4. 基于大模型的分块

等 token更便宜之后

提示词：“基于语义分块，将相似概念放在同一个分块中”

性能高

https://github.com/ceilf6/Lab/commit/02a3b949a83c766bb1a9d17d29b505df715d0784

- 字符数直接作为token会大3-4倍，对应增加了API调用次数，直接对token/3
- 子词切分增强搜索
- 增加了支持的文件语言
- 处理md列表过度分块
- 过滤无用的压缩文件