# AI Application 玩转大模型的核心思路

微调的性价比相对较低，因为微调得到的权重矩阵在生成质量的提升上可能还不如一个大模型新推出一个版本，并且微调的验证时间需要很久

- 应用开发
    
    调用模型服务层暴露的接口
    
    概念（MCP, skills）、开发框架（LangChain、LangGraph、DeepAgent …）
    
- 工具使用
    
    概念、具体工具介绍
    

# 如何理解概念

由于裸模型本质就是 token list → model → 概率分布 ，所以所有在裸模型基础上玩的东西只能玩两个

1. **输入**什么
2. 如何处理**输出**

就像 HTTP 中

- 协议缓存
- 大文件上传
- 单点登录

都是在规定一些内容，本质仍然是一次请求-响应

所以遇到一个概念就是要去看如何进行 输入 和 输出 的处理的

## 方法

1. 抓包
2. 代理服务器

# skill 为例

用户 → claude code -用户输入+系统提示词（包含技能）→ 模型 -决定使用技能→  JSON（按照初始化请求中告诉的格式去调用技能）→ claude code -读取技能全文（渐进式纰漏）→ 模型 → claude code → 用户（最后不再 tool_use 后才会返回 UI 给用户，这点在 cc 源码解析中提过）

初始化时在请求体中有 Tools 中有一个 skill 告诉了大模型该如何去使用技能，例如调用时要说明技能名称等等

在用户输入后会拼接 [CLAUDE.md](http://CLAUDE.md) 文件以及 system-reminder系统提示词，在系统提示词中告诉了大模型本地有哪些技能可供使用，以及在什么时候调用技能