# index

过往**RNN串行**类似于动态规划不断往后的效率太低了

通过Transformer的注意力机制能实现**并行**处理所有词信息

[大模型的3D并行](大模型的3D并行%203230f8d8d1fd80a8ac9fdc24b097fd15.md) 

大模型的上下文限制主要是因为 Transformer 架构需要对每个词料做注意力计算，过长会导致计算代价提高，并且位置编码也很大

仍先用词嵌入的方式得到语句中每个词的词向量信息

然后将每个词在语句中的位置编码加入到该词的词向量中

这时候每个词都互相不知道，没有上下文信息

如果用 RNN 那么无法并行计算、且长语句中长期依赖困难

用训练过程学习得到的 Wq, Wk, Wv 三个矩阵对词向量矩阵进行计算得到

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image.png)

然后用 q1 * k2 得到 a12 ，表示在第一个词视角，和第二个词的相似度、影响力度

**注意力** 即 **相似度、影响力度**

然后 q1 * k3 … 得到 a13, a14 …，所有相加得到 a1 ，在第一个词视角中的**上下文信息**

**注意力头** 即 **在一个词视角中其他词的上下文信息**

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image%201.png)

以此类推得到第二个、第三个…词的视角 a2 , a3 

这就是注意力机制做的事情

还可以给每个词多个学习机会，得到多个 q k v

每一个学习机会拿到一个头，多个那就是 多头注意力机制

通过 多头注意力 可以实现在 **多个层面** 上对词语的分析，例如表达含义、情绪

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image%202.png)

## 架构图

https://arxiv.org/html/1706.03762

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image%203.png)

左边是编码器

右边是解码器

**自回归**：自我影响，编码器中的**自注意力层**中一个词需要关注其他的所有词，而在解码器自注意力层中一个词**只关注其前面的词，后面的词会通过掩码遮住，确保解码器生成时遵循正确的时间顺序，因为前面选择生成的词会影响后面的选择**（例如 ”太阳…“ 选择 ”很“ 之后生成 ”亮“ 的概率比 ”闪耀“ 大，有点DFS的感觉）

仅编码器类型：情感分析

仅解码器类型：**自回归**模型，用于文本生成

两者都有：序列到序列模型

例如左边输入一段要翻译的内容，右边输出的是一个词表，表中有每个词的概率，选择概率最高的那个（推测）

如果训练时有偏差，那么会计算损失函数，然后进行反向传播、调整结构中各个权重矩阵

# 注意力机制

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image%204.png)

## 单头注意力

q * k 得到相似度系数矩阵

然后再 * v 得到包含上下文信息的词向量矩阵

## 多头注意力

多个权重矩阵运算后得到 多头

然后经过线性运算得到最终词向量矩阵

![image.png](工程师沉淀/AI/1%20LLM大模型基层/神经网络/Transformer注意力机制/index/image%205.png)