# 寿司

缓存中通过存储Promise处理并发问题

[**缓存中通过存储Promise处理并发问题**](文件IO%2032f0f8d8d1fd80788323e9099405bd65.md) 

- 找规律：列一下
- 如果70%超时，那么可以多试几次，因为牛客的数据很水，70%的代码在后面可能全过
- 力扣有近30天真题
- 牛客上有真题 https://www.nowcoder.com/exam/company?currentTab=recommand&jobId=100&keyword=%E6%B7%98%E5%A4%A9
- 可以在 小红书 等平台上搜一搜笔试题目

DP 就是 cache DFS 的表格化

二者顺序是相反的，一个从前往后时另一个就是从后往前

DFS 函数有几个参数，DP f 就是几维的

DFS 的边界条件就是 DP f 的初始条件

用 **Infinity**无限 表示不可能

[hooks](hooks%2032c0f8d8d1fd80baba43f1583c9df877.md)

[组件](组件%2032c0f8d8d1fd80398a73cb633a04396d.md)

[真题](真题%203230f8d8d1fd8096b74bf0e7388d0bd0.md)

[Hot 100](Hot%20100%203110f8d8d1fd8018a36be61d68bae9c8.md)

[NodeJS环境IO](NodeJS环境IO%203230f8d8d1fd80b8bddbcf121e1f1d42.md)

[ACM聪明题](ACM聪明题%203280f8d8d1fd80ad9010d10e772f86a2.md)

[优先任务队列 lazyman](优先任务队列%20lazyman%203010f8d8d1fd809eaf01dde7c56237bc.md)

[多个递增数组中找公共元素](多个递增数组中找公共元素%203020f8d8d1fd803c8136c065ff0b9b6a.md)

[二叉树的**右视图**](二叉树的右视图%203020f8d8d1fd802c9611ce35ec226d0c.md)

[146 双向链表LRU缓存](146%20双向链表LRU缓存%203130f8d8d1fd8005b82ec34f5fdea2cc.md)

[236 二叉树最近公共祖先](236%20二叉树最近公共祖先%203130f8d8d1fd80c887dceeed1b0fcd50.md)

[435 无重叠区域](435%20无重叠区域%203130f8d8d1fd8010b3b5ef5f34708d2c.md)

[LCR 146 - 54 螺旋遍历二维数组](LCR%20146%20-%2054%20螺旋遍历二维数组%203130f8d8d1fd80c09856e8d9f148781f.md)

[198 213 打家劫舍](198%20213%20打家劫舍%203130f8d8d1fd8044a495eeb14915247b.md)

[矩形碰撞检测](矩形碰撞检测%203150f8d8d1fd80aeb301d22f4794fe71.md)

[并发执行](并发执行%203170f8d8d1fd80d7897bf7e784c35325.md)

[1143 最长公共子序列 DP](1143%20最长公共子序列%20DP%203190f8d8d1fd803b9f48db5706d260da.md)

[防抖 节流](防抖%20节流%203190f8d8d1fd800a9166f541702a34bf.md)

[深拷贝](深拷贝%203190f8d8d1fd80bd9eb2fd917ba73bdb.md)

[74,240 搜索二维数组I和II](74,240%20搜索二维数组I和II%2031a0f8d8d1fd80b2b25ec9e1e23ed5e5.md)

[47 DFS实现重复数字全排列](47%20DFS实现重复数字全排列%2031b0f8d8d1fd80abbe2fe2a357a7a4c7.md)

[单调栈记录引用 ⇒ 缩进解析](单调栈记录引用%20⇒%20缩进解析%2031f0f8d8d1fd80208404cbee0e2656b1.md)

[44 通配符匹配](44%20通配符匹配%203210f8d8d1fd80be8195d2913890d4cf.md)

[大数操作](大数操作%203220f8d8d1fd80bd97c3ccd1ed159702.md)

[股票问题 DP状态机](股票问题%20DP状态机%203250f8d8d1fd80c49935fb36245b64c4.md)

[97 二维路径DP](97%20二维路径DP%203250f8d8d1fd80188932c31206d96b3b.md)

[76 右拖左双指针 滑动窗口](76%20右拖左双指针%20滑动窗口%203250f8d8d1fd80c489b2d88ea618ad65.md)

[反转列表 206](反转列表%20206%2032c0f8d8d1fd807ea039c232389fe0e0.md)

[Promise.all](Promise%20all%2032d0f8d8d1fd8058a6becbc10ece6f08.md)

[链式调用，收集参数 - 珂里化](链式调用，收集参数%20-%20珂里化%2032d0f8d8d1fd80099e12ec25ca49bba8.md)