# 基本概念 - url, http

# 客户端和服务器

在网络的世界，两个应用之间通信

大部份情况下，一次通信总是由一方发出一个消息开始，另一方回复一个消息结束

发出消息的一方称之为客户端 Client ，发出消息的过程称之为请求 Request

回复消息的一方称之为服务器 Server，回复消息的过程称之为相应 Response

![image.png](工程师沉淀/网络/基本概念%20-%20url,%20http/image.png)

注意几点

1. 不管是客户端，还是服务器，它们都是一个
    
    **应用程序**
    
    ，而不是一台计算机。客户端和服务器可以分布在不同的计算机上，也可以在同一台计算机上，并不需要特殊看待
    
    例如 VS 的 live server 插件就是一个服务器，运行在本地的计算机上。
    
    大部份后端开发的就是服务器程序，前端的 Node 技术也能开发服务器程序
    
2. 客户端和服务器的交互模式称为 C/S结构 。在这种结构中，如果客户端是浏览器的话就称之为 B/S结构
3. 服务器程序往往是为互联网产品提供服务，因此又称之为 web服务器
4. 一次完整的交互，总是从请求开始，响应结束

# Url

要完成一次请求和响应，首先需要让客户端找到服务器，不仅如此，还要找到服务器上想要的资源

那么就通过 url地址

uniform resource locator 

统一资源定位符

是一个字符串，用于**表示资源在互联网中的位置**

## 格式

协议 :// 主机 : 端口 / 路径 ? 参数 # hash

## 协议 **Protocal / Schema**

客户端希望用什么方式和服务器沟通

## 主机 **Host**

在哪台计算机上寻找资源

两种写法

1. IP 地址，是网络中计算机的唯一编号
    
    127.0.0.1 代表本机
    
    每个数字范围 0~255 
    
2. 域名，类似于 IP地址的别名，利于记忆
    
    **localhost 即 127.0.0.1**
    

## 端口 **Port**

表示客户端希望在哪个**应用程序**中寻找资源

**每个服务器程序，都会监听一个或多个端口**，只有找到对应的端口号才能找到对应的程序

端口不写的话

http 默认端口 80

https 默认端口 443

## 路径 Path

在服务器程序中找服务

路径不写的话默认为 /

## 参数 Query / Param

资源服务需要根据需要呈现不同的内容，比如一篇新闻列表的页面，可以指定它呈现第几页的新闻，而 “第几页” 就是服务的额外信息，就通过参数传输

?query1=value1&query2=value2

URL 中只能出现 ASCII 字符，像中文会被编码为 % 

## hash

锚链接

# http

NodeJS 创建客户端和服务器示范

[net模块](net模块%203310f8d8d1fd80c28f3ceee30fb1a0f7.md) 

https://github.com/ceilf6/Lab/blob/main/NodeJS/sandboxs/net/server.js

https://github.com/ceilf6/Lab/blob/main/NodeJS/sandboxs/net/client.js

\r\n 格式

https://github.com/ceilf6/Lab/commit/92d0e58f1d3dafa53a18a1e96b6955183de1cbc7

在找到服务后，双方需要用“同一种语言”进行对话

> https是在http协议基础上发展起来的，增加了安全性
> 

http 是基于 请求-响应 的方式完成通信的，每一次通信都是由客户端向服务器发送请求，经过服务器处理后响应客户数据

http 协议规定

1. **每次 请求-响应 都是独立的**，互相之间互不干扰
    
    无状态协议、断开式连接
    
2. 每次 请求-响应 传递的信息都是 字符串，且文本格式必须按照 http 协议规定的格式书写

## 请求

三部分

1. 请求行 高度概括客户端想要干什么
    
    注意 行在头前面
    
2. 请求头 描述了请求的一些额外信息
3. 请求体 包含了要给服务器传递的正文数据（请求体是可以省略的）（像传递账号密码）

![image.png](工程师沉淀/网络/基本概念%20-%20url,%20http/image%201.png)

### 1. 请求行

请求行是整个 http 报文的第一行字符串，包含三个部份

1. 请求方法，表达了客户端的动作
    
    method属性
    
    在 http 协议中，没有规定限定动作，也没有规定每种动作会带来怎样的变化（类似于文章的标题），在实际使用中有一些约定俗成的规范
    
    GET 获取资源
    
    POST 提交消息
    
    PUT 修改数据
    
    DELETE 删除数据
    
    并且 GET 和 DELETE 请求不能有请求体、所以通过**URL**放入**请求行**中携带参数，而 POST 和 PUT 请求可以有请求体
    
2. 中间是 url 除协议和IP地址外、即**路径开始往后**的所有内容
3. HTTP协议版本

在浏览器中获取数据、浏览器自动发出的请求一般是GET

输入地址

点击a元素

获取图片

获取css,js,字体

而POST请求需要开发者手动处理，例如form中设置method为POST

### 请求方法本质

请求方法是请求行的第一个单词，向服务器描述了客户端发出请求的动作类型，在HTTP协议中不同的请求方法只是包含了不同的语义，但服务器和浏览器的一些约定俗成的行为造成了具体的区别

![image.png](工程师沉淀/网络/基本概念%20-%20url,%20http/image%202.png)

```jsx
fetch('<https://www.baidu.com>', {
  method: 'heiheihei', // 告诉百度，我这次请求是来嘿嘿嘿的
});
```

上面这个请求虽然服务器无法理解，但是也是可以发到的

常见的请求方法共识

- GET 表示向服务器获取资源，没有请求体，业务数据在URL中、即请求行中
- POST 表示向服务器提交信息，通常用于产生新数据，比如注册。业务数据在请求体中
- PUT 表示希望修改服务器的数据，通常用于修改，业务数据在请求体中
- DELETE 表示希望删除服务器的数据，没有请求体，业务数据在请求行中
- OPATIONS 发生在跨域的预检请求中，表示客户端向服务器申请跨域提交
- TRACE 回显服务器收到的请求，一般是用于测试、诊断
- CONNECT 建立连接管道，通常在代理场景中使用

### POST 和 GET 的区别

**本质没有区别**，都是请求行的第一个单词，是客户端和服务器在长期交互过程中产生**共识**造成的**语义区别**，同时**浏览器对请求行的限制**导致了区别

1. 浏览器在发送**GET请求时，不会附带请求体**
2. GET 请求的传递信息量有限 - **浏览器对请求行有大小限制**，适合传递少量数据；POST请求的传递信息量没有限制，适合传输大量数据
3. **浏览器限定请求行不能有非ASCII数据**，所以GET 请求只能传递 ASCII 数据**，**这也是为什么url中没有中文。浏览器会自动对 非ASCII字符、&特殊符号进行编码encodeURIComponent
4. 大部份 GET 请求传递的数据都附带在**参数**中，能够通过分享地址完整的**重现页面**，但同时暴露了数据，若有敏感数据不应该用 GET 请求
5. 刷新页面时，若当前的页面是通过 POST 请求得到的，则浏览器会提示用户是否重新提交。若是 GET 请求得到的页面则没有提示。
6. GET 请求的地址可以被保存为浏览器书签，POST 不可以

### 2. 请求头

请求头是一系列的键值对，里面包含的诸多和业务无关的额外信息，大部份服务器是不需要的

> 可以不用，但是不可以不给
> 
1. Host: url 地址中的主机
2. User-Agent: 客户端的信息描述，用什么软件应用发出的
3. **Content-type**: **请求体**的**消息格式 MIME**
    
    enctype 属性
    
    - application/x-www-form-urlencoded
        
        表示请求体的数据格式和 url 地址中参数的格式一样，例如 
        
        ```css
        loginId=admin&loginPwd=123123
        ```
        
    - **application/json**
        
        表示请求体的数据是 json 格式，例如
        
        ```css
        { "loginId": "admin", "loginPwd": "123123" }
        ```
        
    - **multipart/form-data**
        
        使用某个随机字符串作为属性之间的分隔符，通常用于文件上传
        

### 3. 请求体

像 **元素name属性** 就是**请求体中的键**

网络 - 载荷

请求体的格式一定要遵循 Content-type 的格式

像在 Postman 中可以在

Headers 请求头

Body 请求体

raw 原始格式，例如 application/json

```css
{
	"loginId": "ceilf6"
}
```

## 响应

三部分

1. 响应行
2. 响应头
3. 响应体

![image.png](工程师沉淀/网络/基本概念%20-%20url,%20http/image%203.png)

### 1. 响应行

两个部分

1. HTTP协议版本
2. 状态码 状态消息：表示服务器对当前请求的表态
    
    通常状态消息和状态码是对应的，像 200 一般是 OK
    

**状态码分为五类**

1** 信息，服务器收到请求，需要请求者继续执行操作。例如**还需要信息**，让客户端继续发送；**协议版本的协商**

2** 成功，操作被成功接受并处理

3** 重定向，需要进一步的操作以完成请求

4** 客户端错误，请求包含语法错误或无法完成请求

5** 服务器错误，服务器在处理请求的过程中发生了错误

**常见的状态码**

1. 200 OK 一切正常
2. 301 Moved Permanently 资源已被**永久**重定向
    
    “你的请求我收到了，但是你要的东西不在这里，我已经永远的把它移动到另一个地址，麻烦你去请求新的地址
    
    ，新地址放到响应头的 Location 中了“
    
    永久重定向浏览器会缓存，到时候如果再请求就不会真实发送请求了，直接到 Location 中的那个地址了
    
3. 308 永久重定向，且请求方法不能变
4. 302 **临时**重定向
    
    临时的移动了资源，还要麻烦你再去请求我放在响应头的 Location 
    
5. 307 临时重定向，且请求方法不能变
6. 304 Not Modified
    
    **浏览器缓存超出有效期**了（如果还在有效期内是返回的200）客户端发送请求到服务器询**问缓存文件还能继续用**吗？即是否变更过，如果没有变更过浏览器就会返回 304 让客户端放心用缓存
    
7. 400 **Bad Request**: 语义有误，当前请求无法被服务器理解
    
    例如**请求体格式错误**
    
8. 403 Forbidden: 服务器**拒绝**执行
    
    一般是**客户端权限**不够
    
9. 404 Not Found: 资源不存在
10. 500 Internel Server Error: 服务器内部错误

### 2. 响应头

和请求头一样，也是很多键值对

有哪些键值对取决于服务器程序

其中最重要的就是 **Content-Type** 表示响应体的数据类型 MIME

在 B/S 模式中，**浏览器会自动根据响应头中 Content-Type 的取值，决定如何处理**

1. text/plain 纯文本 浏览器会直接原封不动展示
2. text/html 浏览器将响应体作为**页面**进行渲染
3. text/javascript 或 application/javascript 是 js代码，浏览器会使用 JS解析器 **V8引擎**将其解析执行
4. text/css 是css代码，浏览器会将其作为样式
5. image/jpeg 是 jpg 图片
6. **attachment** 附件 浏览器看到这个类型会**自动触发下载**

### 3. 响应体

按照响应头中 Content-Type 格式返回数据

Content-Type 中可能还会带有编码方式 charset=utf-8

```css
Content-Type: text/html;charset=utf-8
```

像**业务错误的状态码仍然是200，错误信息是包含在响应体中**